Repository: microsoft/XamlBehaviors
Catalog: src/BehaviorsSDKManaged/Microsoft.Xaml.Interactions/Resources/*/Strings.resw
Source language: en_us
Languages: de_de, fr_fr, pt_br, uk_ua, zh_cn, zh_tw

# CannotAttachBehaviorMultipleTimesExceptionMessage
source: An instance of a behavior cannot be attached to more than one object at a time.
de_de: Eine Instanz eines Verhaltens kann nicht mehreren Objekten gleichzeitig angefügt werden.
fr_fr: Une instance de Behavior ne peut pas être attachée à plus d'un objet à la fois.
pt_br: Não é possível anexar uma instância de Behavior a mais de um objeto simultaneamente.
uk_ua: Неможливо прикріпити екземпляр поведінки до декількох об'єктів одночасно.
zh_cn: 行为的实例不能一次附加到多个对象。
zh_tw: 無法一次將行為執行個體附加到多個物件。

# CannotFindEventNameExceptionMessage
source: Cannot find an event named {0} on type {1}.
de_de: Kein Ereignis mit der Bezeichnung {0} auf Typ {1} gefunden.
fr_fr: Impossible de trouver un événement nommé {0} sur le type {1}.
pt_br: Não é possível encontrar um evento de nome {0} no tipo {1}.
uk_ua: Неможливо знайти подію з ім'ям {0} в типі {1}.
zh_cn: 在类型 {1} 上找不到名为 {0} 的事件。
zh_tw: 在類型 {1} 上找不到名稱為 {0} 的事件。

# ChangePropertyActionCannotFindPropertyNameExceptionMessage
source: Cannot find a property named {0} on type {1}.
de_de: Keine Eigenschaft mit der Bezeichnung {0} auf Typ {1} gefunden.
fr_fr: Impossible de trouver une propriété nommée {0} sur le type {1}.
pt_br: Não é possível encontrar uma propriedade de nome {0} no tipo {1}.
uk_ua: Неможливо знайти властивість з ім'ям {0} в типі {1}.
zh_cn: 在类型 {1} 上找不到名为 {0} 的属性。
zh_tw: 在類型 {1} 上找不到名稱為 {0} 的屬性。

# ChangePropertyActionCannotSetValueExceptionMessage
source: Cannot assign value of type {0} to property {1} of type {2}. The {1} property can be assigned only values of type {2}.
de_de: Kann keinen Wert vom Typ {0} zu einer Eigenschaft {1} vom Typ {2} zuweisen. Die Eigenschaft {1} kann nur Werten vom Typ {2} zugewiesen werden.
fr_fr: Impossible d'attribuer une valeur de type {0} à la propriété {1} de type {2}. Seules des valeurs de type {2} peuvent être attribuées à la propriété {1}.
pt_br: Nao é possível atribuir um valor do tipo {0} à propriedade {1} de tipo {2}. A propriedade {1} pode receber somente valores do tipo {2}.
uk_ua: Неможливо призначити значення типу {0} властивості {1} типу {2}. Властивості {1} можна призначити тільки значення типу {2}.
zh_cn: 无法将 {0} 类型的值赋予 {2} 类型的属性 {1}。{1} 属性只可接受 {2} 类型的赋值。
zh_tw: 無法將類型 {0} 的值指派給類型 {2} 的屬性 {1}。只有類型 {2} 的值能夠指派給 {1} 屬性。

# ChangePropertyActionPropertyIsReadOnlyExceptionMessage
source: Property {0} defined by type {1} does not expose a set method and therefore cannot be modified.
de_de: Die vom Typ {1} definierte Eigenschaft {0} gibt keine Methode zum Festlegen an und kann daher nicht geändert werden.
fr_fr: La propriété {0} définie par le type {1} n'expose pas une méthode set et ne peut, par conséquent, pas être modifiée.
pt_br: A propriedade {0} definido pelo tipo {1} não expõe um método set e, portanto, não pode ser modificado.
uk_ua: Властивість {0}, яке визначається типом {1}, не надає заданий метод і, отже, не може бути змінено.
zh_cn: 类型 {1} 定义的属性 {0} 不 揭示 set 方法，因此不可修改。
zh_tw: 類型 {1} 所定義的屬性 {0} 未公開 set 方法，因此無法修改。

# EventNotSupportedExceptionMessage
source: Event {0} is not supported. Consider implementing a custom IBehavior to respond to this event.
de_de: Ereignis {0} ist nicht unterstützt. Erwägen Sie die Implementierung eines benutzerdefinierten IBehavior, um auf dieses Ereignis zu reagieren.
fr_fr: L'événement {0} n'est pas pris en charge. Si possible, implémentez un type iBehavior personnalisé pour répondre à cet événement.
pt_br: Evento {0} não é suportado. Considere a implementação de um IBehavior personalizado para responder a este evento.
uk_ua: Подія {0} не підтримується. Для відгуку на дану подію рекомендується реалізувати користувальницьку поведінку IBehavior.
zh_cn: 不支持事件 {0}。请考虑实现自定义 IBehavior 以响应此事件。
zh_tw: 不支援事件 {0}。請考慮實作自訂的 IBehavior 以回應這個事件。

# GoToStateActionTargetHasNoStateGroups
source: Target {0} does not define any VisualStateGroups.
de_de: Das Ziel {0} definiert keine VisualStateGroups.
fr_fr: La cible {0} ne définit pas de VisualStateGroups.
pt_br: O destino {0} não define qualquer VisualStateGroups.
uk_ua: Цільовий об'єкт {0} не визначає ніяких груп VisualStateGroups.
zh_cn: 目标 {0} 不定义任何 VisualStateGroups。
zh_tw: 目標 {0} 未定義任何 VisualStateGroups。

# InvalidLeftOperand
source: Binding property of type {0} cannot be used with operator {1}.
de_de: Die Bindungseigenschaft vom Typ {0} kann nicht mit dem Operator {1} verwendet werden.
fr_fr: La propriété de liaison de type {0} ne peut pas être utilisée avec l'opérateur {1}.
pt_br: A propriedade Binding do tipo {0} não pode ser usada com o operador {2}.
uk_ua: Властивість прив'язки типу {0} неможливо використовувати з оператором {1}.
zh_cn: {0} 类型的 Binding 属性无法用于运算符 {1}。
zh_tw: 類型 {0} 的 Binding 屬性無法搭配運算子 {1} 一起使用。

# InvalidOperands
source: Binding property of type {0} and Value property of type {1} cannot be used with operator {2}.
de_de: Die Bindungseigenschaft vom Typ {0} und die Werteigenschaft vom Typ {1} können nicht mit dem Operator {2} verwendet werden.
fr_fr: La propriété de liaison de {0} la propriété de valeur de type {1} ne peuvent pas être utilisées avec l'opérateur {2}.
pt_br: A propriedade Binding do tipo {0} e a propriedade Value do tipo {1} não podem ser usadas com o operador {2}.
uk_ua: Властивість прив'язки типу {0} і властивість значення типу {1} неможливо використовувати з оператором {2}.
zh_cn: {0} 类型的 Binding 属性以及 {1} 类型的 Value 属性无法用于运算符 {2}。
zh_tw: 類型 {0} 的 Binding 屬性和類型 {1} 的 Value 屬性無法搭配運算子 {2} 一起使用。

# InvalidRightOperand
source: Value property of type {0} cannot be used with operator {1}.
de_de: Die Werteigenschaft vom Typ {0} kann nicht mit dem Operator {1} verwendet werden.
fr_fr: La propriété de valeur de type {0} ne peut pas être utilisée avec l'opérateur {1}.
pt_br: A propriedade de valor do tipo {0} não pode ser usada com o operador {1}.
uk_ua: Властивість значення типу {0} неможливо використовувати з оператором {1}.
zh_cn: {0} 类型的 Value 属性无法用于运算符 {1}。
zh_tw: 類型 {0} 的 Value 屬性無法搭配運算子 {1} 一起使用。
